Repository: yorha59/glotty
Catalog: Glotty/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, zh_hans, zh_hant

source: The language you speak natively. Drives auto-detected source / target choices and biases translation behavior toward what you're likely reading or writing. Also the language Fn → E (Explain) renders its explanations in, and — unless you've overridden it in the System tab — the language Glotty's UI uses on the next launch.
de: Ihre Muttersprache. Bestimmt die automatisch erkannten Quell-/Zielsprachen und verändert das Übersetzungsverhalten zu dem, was Sie wahrscheinlich lesen oder schreiben. Außerdem ist es die Sprache, in der Fn → E (Erklären) seine Erklärungen rendert und — es sei denn, Sie haben es im Register "System" überschrieben — die Sprache, die die Benutzeroberfläche von Glotty beim nächsten Start verwendet.
es: El idioma que hablas de forma nativa. Determina las opciones de origen/destino detectadas automáticamente y sesga el comportamiento de traducción hacia lo que probablemente estás leyendo o escribiendo. También es el idioma en el que Fn → E (Explicar) renderiza sus explicaciones, y — a menos que lo hayas anulado en la pestaña Sistema — el idioma que la interfaz de Glotty usa en el siguiente inicio.
fr: La langue que vous parlez nativement. Détermine les choix de source/cible détectés automatiquement et influence le comportement de traduction vers ce que vous lisez ou écrivez probablement. C'est aussi la langue dans laquelle Fn → E (Expliquer) rend ses explications, et — sauf si vous l'avez remplacé dans l'onglet Système — la langue que l'interface de Glotty utilise au prochain lancement.
ja: あなたが母語として話す言語。自動検出されたソース/ターゲットの選択を駆動し、翻訳の挙動をあなたがおそらく読んだり書いたりしているものに偏らせます。また、Fn → E（説明）がその説明を表示する言語でもあり — システムタブで上書きしない限り — GlottyのUIが次回起動時に使用する言語でもあります。
ko: 원어민이 사용하는 언어입니다. 자동 감지된 소스/대상 선택을 주도하며, 읽거나 쓸 가능성이 있는 콘텐츠로 번역 동작을 편향시킵니다. 또한 Fn → E(설명)가 설명을 렌더링하는 언어이며 — 시스템 탭에서 재정의하지 않는 한 — Glotty UI의 다음 시작 시 사용되는 언어입니다.
zh_hans: 你母语使用的语言。驱动自动检测的源语言/目标语言选择，并使翻译行为偏向你可能正在阅读或写作的内容。也是 Fn → E（解释）呈现其解释的语言，并且 — 除非你在系统标签页中覆盖了它 — Glotty 的界面在下次启动时使用的语言。
zh_hant: 您母語的語言。驅動自動偵測的來源/目標語言選擇，並使翻譯行為偏向您可能正在閱讀或書寫的內容。同時也是 Fn → E (解釋) 用於呈現解說的語言，並且 — 除非您已在「系統」標籤頁中覆寫 — 是 Glotty 使用者介面在下一次啟動時使用的語言。

source: The language you speak natively. Drives auto-detected source / target choices and biases translation behavior toward what you're likely reading or writing. Separate from Glotty's UI language below.
de: Ihre Muttersprache. Bestimmt die automatisch erkannten Quell-/Zielsprachen und beeinflusst die Übersetzungsrichtung auf das, was Sie wahrscheinlich lesen oder schreiben. Getrennt von der Benutzeroberflächensprache von Glotty unten.
es: El idioma que hablas de forma nativa. Determina las opciones de origen/destino detectadas automáticamente y orienta el comportamiento de traducción hacia lo que probablemente estás leyendo o escribiendo. Separado del idioma de la interfaz de Glotty de abajo.
fr: La langue que vous parlez nativement. Détermine les choix source/cible détectés automatiquement et influence le comportement de traduction vers ce que vous êtes susceptible de lire ou d'écrire. Séparé de la langue de l'interface utilisateur de Glotty ci-dessous.
ja: あなたの母語です。自動検出されるソース/対象言語の選択に影響を与え、おそらく読んだり書いたりする内容に翻訳の挙動が偏ります。下のGlottyのUI言語とは別です。
ko: 본래 사용하는 언어입니다. 자동 감지된 소스/대상 선택을 결정하고 번역 동작을 사용자가 읽거나 쓸 가능성이 있는 쪽으로 기울게 합니다. 아래의 Glotty UI 언어와는 별개입니다.
zh_hans: 你的母语。用于自动判断源语言 / 目标语言,并优化你常读写语言的翻译表现。与下方 Glotty 的界面语言相互独立。
zh_hant: 您的母語。驅動自動偵測的來源/目標選擇，並使翻譯行為偏向您可能正在閱讀或撰寫的內容。與下方的 Glotty 介面語言無關。

source: The leader is the first key of every shortcut. Hold it, then tap the command key below.
de: Die Leitertaste ist die erste Taste jeder Verknüpfung. Halten Sie sie gedrückt, tippen Sie dann auf die untenstehende Befehlstaste.
es: La tecla líder es la primera tecla de cada atajo. Mantén pulsada esta tecla, luego pulsa la tecla de comando de abajo.
fr: La touche principale est la première touche de chaque raccourci. Maintenez-la enfoncée, puis tapez sur la touche de commande ci-dessous.
ja: リーダーキーはすべてのショートカットの最初のキーです。これを押し続け、その下のコマンドキーをタップしてください。
ko: 리더는 모든 단축키의 첫 번째 키입니다. 이 키를 누른 상태에서 아래의 명령 키를 탭하세요.
zh_hans: 引导键是每个快捷键的第一个键。按住它，然后轻点下面的命令键。
zh_hant: 首鍵是每個快捷鍵的第一個按鍵。按住它，然後點擊下方的指令按鍵。

source: The model is still downloading. Try again in a few minutes.
de: Das Modell wird noch heruntergeladen. Versuchen Sie es in ein paar Minuten erneut.
es: El modelo todavía se está descargando. Inténtalo de nuevo en unos minutos.
fr: Le modèle est encore en téléchargement. Réessayez dans quelques minutes.
ja: モデルのダウンロード中です。数分後に再度お試しください。
ko: 모델이 여전히 다운로드 중입니다. 몇 분 후에 다시 시도하세요.
zh_hans: 模型仍在下载中。请几分钟后重试。
zh_hant: 模型仍在下載中。請幾分鐘後再試。

source: Theme
de: Thema
es: Tema
fr: Thème
ja: テーマ
ko: 테마
zh_hans: 主题
zh_hant: 主題

source: Then quit & relaunch Glotty.
de: Dann beenden Sie Glotty und starten Sie es neu.
es: Entonces cierra y vuelve a abrir Glotty.
fr: Quittez ensuite et relancez Glotty.
ja: 次にGlottyを終了して再起動してください。
ko: 그런 다음 Glotty를 종료하고 다시 실행합니다.
zh_hans: 然后退出并重新启动 Glotty。
zh_hant: 然後退出並重新啟動 Glotty。

source: Thinking…
de: Denken…
es: Pensando…
fr: Pensée…
ja: 考え中…
ko: 생각 중…
zh_hans: 思考中…
zh_hant: 思考中…

source: This Mac doesn't support Apple Intelligence
de: Dieser Mac unterstützt kein Apple Intelligence
es: Este Mac no es compatible con Apple Intelligence
fr: Cet Mac ne prend pas en charge Apple Intelligence
ja: このMacはApple Intelligenceをサポートしていません
ko: 이 Mac은 Apple Intelligence를 지원하지 않습니다
zh_hans: 此 Mac 不支持 Apple Intelligence
zh_hant: 這台 Mac 不支援 Apple Intelligence

source: This backup includes your API keys. Choose a password — you'll need it to restore on another machine.
de: Diese Sicherung enthält Ihre API-Schlüssel. Wählen Sie ein Passwort — Sie werden es benötigen, um auf einem anderen Gerät wiederherzustellen.
es: Esta copia de seguridad incluye tus claves de API. Elige una contraseña — la necesitarás para restaurar en otra máquina.
fr: Cette sauvegarde inclut vos clés API. Choisissez un mot de passe — vous en aurez besoin pour restaurer sur un autre appareil.
ja: このバックアップにはAPIキーが含まれています。パスワードを選択してください — 別のマシンで復元する際に必要になります。
ko: 백업에는 API 키가 포함되어 있습니다. 비밀번호를 선택하십시오 - 다른 컴퓨터에서 복원할 때 필요합니다.
zh_hans: 此备份包含您的 API 密钥。请选择一个密码 — 您将需要它来在另一台机器上恢复数据。
zh_hant: 此備份包含您的 API 金鑰。請選擇一個密碼 — 您將需要在另一台機器上還原時使用它。

source: This deletes every recorded lookup and polish issue. Cannot be undone.
de: Dies löscht alle aufgezeichneten Nachschlageseien und Polnisch-Probleme. Kann nicht rückgängig gemacht werden.
es: Esto elimina todas las consultas y problemas de pulido registrados. No se puede deshacer.
fr: Ceci supprime chaque recherche et problème de polissage enregistrés. Impossible d'annuler.
ja: これにより、記録されたすべての検索とポリッシュの問題が削除されます。元に戻すことはできません。
ko: 이 모든 기록된 조회와 다듬기 문제가 삭제됩니다. 실행 취소할 수 없습니다.
zh_hans: 这将删除所有已记录的查询和润色问题。无法撤销。
zh_hant: 這將刪除所有已記錄的查詢和精修問題。此操作無法還原。

source: This month
de: Diesen Monat
es: Este mes
fr: Ce mois-ci
ja: 今月
ko: 이번 달
zh_hans: 本月
zh_hant: 這個月

source: This removes every recorded LLM call from local history. The setting cannot be undone.
de: Dies entfernt alle aufgezeichneten LLM-Aufrufe aus dem lokalen Verlauf. Die Einstellung kann nicht rückgängig gemacht werden.
es: Esto elimina todas las llamadas registradas de LLM del historial local. La configuración no se puede deshacer.
fr: Ceci supprime chaque appel enregistré au LLM de l'historique local. Le paramètre ne peut pas être annulé.
ja: これにより、ローカル履歴から記録されたすべてのLLM呼び出しが削除されます。この設定は元に戻すことができません。
ko: 이 모든 기록된 LLM 호출을 로컬 기록에서 제거합니다. 설정은 취소할 수 없습니다.
zh_hans: 这将删除本地历史中的所有已记录的 LLM 调用。该设置无法撤销。
zh_hant: 這將移除本機歷史中的所有已記錄 LLM 呼叫。此設定無法還原。

source: This week
de: Diese Woche
es: Esta semana
fr: Cette semaine
ja: 今週
ko: 이번 주
zh_hans: 本周
zh_hant: 這週

source: This will OVERWRITE existing preferences, memories, contexts, chat history, and activity history on this machine.
de: Dies wird BESTEHENDE Einstellungen, Erinnerungen, Kontexte, Chat-Verlauf und Aktivitätsverlauf auf diesem Gerät ÜBERSCHREIBEN.
es: Esto SOBRESCRIBIRÁ las preferencias existentes, los recuerdos, los contextos, el historial de chat y el historial de actividad en esta máquina.
fr: Ceci va ÉCRASER les préférences existantes, les souvenirs, les contextes, l'historique des discussions et l'historique d'activité sur cette machine.
ja: これにより、このマシンの既存の設定、メモリー、コンテキスト、チャット履歴、および活動履歴が上書きされます。
ko: 이 기기에 있는 기존의 설정, 기억, 컨텍스트, 채팅 기록 및 활동 기록을 덮어씁니다.
zh_hans: 此操作将**覆盖**本机现有的偏好设置、记忆、上下文、聊天历史和活动历史。
zh_hant: 這將覆寫此裝置上現有的偏好設定、記憶、情境、聊天歷史和活動歷史。

source: Time range
de: Zeitraum
es: Rango de tiempo
fr: Plage de temps
ja: 時間範囲
ko: 기간
zh_hans: 时间范围
zh_hant: 時間範圍

source: Today
de: Heute
es: Hoy
fr: Aujourd'hui
ja: 今日
ko: 오늘
zh_hans: 今天
zh_hant: 今天

source: Toggle contents
de: Inhalte umschalten
es: Conmutar contenidos
fr: Basculer le contenu
ja: コンテンツの切り替え
ko: 내용 전환
zh_hans: 切换内容
zh_hant: 切換內容

source: Token usage
de: Token-Nutzung
es: Uso de tokens
fr: Utilisation de jetons
ja: トークン使用量
ko: 토큰 사용량
zh_hans: 用量明细
zh_hant: Token 使用量

source: Tokens consumed by the configured LLM provider. Stored locally at ~/Library/Application Support/Glotty/usage.jsonl.
de: Tokens, die vom konfigurierten LLM-Anbieter verbraucht werden. Lokal gespeichert unter ~/Library/Application Support/Glotty/usage.jsonl.
es: Tokens consumidos por el proveedor de LLM configurado. Almacenados localmente en ~/Library/Application Support/Glotty/usage.jsonl.
fr: Jetons consommés par le fournisseur LLM configuré. Stockés localement à ~/Library/Application Support/Glotty/usage.jsonl.
ja: 設定されたLLMプロバイダーによって消費されたトークンです。~/Library/Application Support/Glotty/usage.jsonlにローカルに保存されます。
ko: 구성된 LLM 공급자가 소비한 토큰입니다. 로컬에 ~/Library/Application Support/Glotty/usage.jsonl에 저장됩니다.
zh_hans: 当前 LLM 服务商已消耗的 token 数量。本地保存于 ~/Library/Application Support/Glotty/usage.jsonl。
zh_hant: 由已設定的 LLM 提供者消耗的 Token。儲存在本地的 ~/Library/Application Support/Glotty/usage.jsonl。

source: Top-to-bottom priority controls lookup order for the current Translation source and target.
de: Die Priorität von oben nach unten steuert die Suchreihenfolge für die aktuelle Übersetzungsquelle und das Ziel.
es: La prioridad de arriba abajo controla el orden de búsqueda para el origen y destino de Traducción actuales.
fr: La priorité de haut en bas contrôle l'ordre de recherche pour la source et la cible de traduction actuelles.
ja: 上から下への優先度が、現在の翻訳ソースと対象の検索順序を制御します。
ko: 위에서 아래로의 우선순위가 현재 번역 소스와 대상에 대한 조회 순서를 제어합니다.
zh_hans: 从上到下的优先级决定了当前翻译源 / 目标语言对的查询顺序。
zh_hant: 從上到下的優先順序控制目前翻譯來源和目標的查詢順序。

source: Total tokens
de: Gesamte Tokens
es: Total de tokens
fr: Total des jetons
ja: 合計トークン数
ko: 총 토큰 수
zh_hans: 总 token 数
zh_hant: 總計 Token 數

source: Translate
de: Übersetzen
es: Traducir
fr: Traduire
ja: 翻訳する
ko: 번역
zh_hans: 翻译
zh_hant: 翻譯

source: Translate (target → native)
de: Übersetzen (Ziel → Muttersprache)
es: Traducir (destino → nativo)
fr: Traduire (cible → natif)
ja: 翻訳 (対象 → 母語)
ko: 번역 (대상 → 본래 언어)
zh_hans: 翻译 (目标 → 母语)
zh_hant: 翻譯 (目標語言 → 母語)

source: Translate to %@
de: Übersetzen nach %@
es: Traducir a %@
fr: Traduire vers %@
ja: %@に翻訳する
ko: %@로 번역
zh_hans: 翻译为%@
zh_hant: 翻譯為 %@

source: Translate, Explain, and Polish act on the selected text via the macOS Services menu (right-click → Services). Those shortcuts are managed by macOS — enable or rebind them in System Settings → Keyboard → Keyboard Shortcuts → Services. Chat (⌘⌥C) works anywhere and is built in.
de: Übersetzen, Erklären und Verbessern wirken auf den ausgewählten Text über das macOS-Menü 'Dienste' (Rechtsklick → Dienste). Diese Tastenkürzel werden von macOS verwaltet – aktivieren Sie sie oder ordnen Sie sie in Systemeinstellungen → Tastatur → Tastenkürzel → Dienste neu zu. Chat (⌘⌥C) funktioniert überall und ist fest integriert.
es: Traducir, Explicar y Pulir actúan sobre el texto seleccionado a través del menú Servicios de macOS (clic derecho → Servicios). Esos accesos directos son gestionados por macOS — habilítalos o vuelve a asignarlos en Configuración del sistema → Teclado → Atajos de teclado → Servicios. Chat (⌘⌥C) funciona en cualquier lugar y está integrado.
fr: Translate, Explain, and Polish agissent sur le texte sélectionné via le menu Services de macOS (clic droit → Services). Ces raccourcis sont gérés par macOS — activez ou réattribuez-les dans les Paramètres Système → Clavier → Raccourcis clavier → Services. Chat (⌘⌥C) fonctionne partout et est intégré.
ja: 翻訳、説明、推敲は、macOS サービスメニュー（右クリック → サービス）から選択したテキストに対して実行されます。これらのショートカットは macOS によって管理されます — システム設定 → キーボード → キーボードショートカット → サービスで有効化または再バインドしてください。チャット (⌘⌥C) はどこでも動作し、組み込み機能です。
ko: 번역, 설명, 다듬기는 macOS 서비스 메뉴(마우스 오른쪽 클릭 → 서비스)에서 선택한 텍스트에 작동합니다. 해당 단축키는 macOS에서 관리되므로 시스템 설정 → 키보드 → 키보드 단축키 → 서비스에서 활성화하거나 다시 바인딩할 수 있습니다. 채팅(⌘⌥C)은 어디서나 작동하며 기본으로 제공됩니다.
zh_hans: 翻译、解释和润色功能通过 macOS 服务菜单（右键点击 → 服务）对选定的文本执行操作。这些快捷键由 macOS 管理 — 在 系统设置 → 键盘 → 键盘快捷键 → 服务 中启用或重新绑定它们。聊天 (⌘⌥C) 可在任何地方使用且为内置功能。
zh_hant: 翻譯、解釋與潤飾功能透過 macOS 的功能表選項對所選文字進行操作 (右鍵點擊 → 功能)。這些快捷鍵由 macOS 管理，可於「系統設定」→「鍵盤」→「快捷鍵」→「服務」中啟用或重新設定。聊天功能 (⌘⌥C) 可在任何地方使用，為內建功能。

source: Translating UI… %@ / %@
de: Benutzeroberfläche wird übersetzt… %@ / %@
es: Traduciendo interfaz… %@ / %@
fr: Traduction de l'interface… %@ / %@
ja: UIを翻訳中… %@ / %@
ko: UI 번역 중… %@ / %@
zh_hans: 正在翻译界面… %@ / %@
zh_hant: 翻譯介面中… %@ / %@

source: Translating UI… %d / %d
de: UI übersetzen… %d / %d
es: Traduciendo UI… %d / %d
fr: Traduction de l'UI… %d / %d
ja: UIを翻訳中… %d / %d
ko: UI 번역 중… %d / %d
zh_hans: 正在翻译用户界面… %d / %d
zh_hant: 正在翻譯介面… %d / %d

source: Translating…
de: Übersetzen…
es: Traduciendo…
fr: Traduction…
ja: 翻訳中…
ko: 번역 중…
zh_hans: 翻译中…
zh_hant: 翻譯中…

source: Translation
de: Übersetzung
es: Traducción
fr: Traduction
ja: 訳
ko: 번역
zh_hans: 翻译
zh_hant: 翻譯

source: Translation engine
de: Übersetzungsengine
es: Motor de traducción
fr: Moteur de traduction
ja: 翻訳エンジン
ko: 번역 엔진
zh_hans: 翻译引擎
zh_hant: 翻譯引擎

source: Translations
de: Übersetzungen
es: Traducciones
fr: Traductions
ja: 翻訳
ko: 번역
zh_hans: 翻译
zh_hant: 翻譯

source: Troubleshooting
de: Fehlerbehebung
es: Solución de problemas
fr: Dépannage
ja: トラブルシューティング
ko: 문제 해결
zh_hans: 故障排查
zh_hant: 故障排除

source: Two commands are bound to the same key — only the first will fire.
de: Zwei Befehle sind derselben Taste zugeordnet — nur der erste wird ausgeführt.
es: Dos comandos están asignados a la misma tecla; solo se ejecutará el primero.
fr: Deux commandes sont assignées à la même touche — seule la première sera exécutée.
ja: 2つのコマンドが同じキーに割り当てられています — 最初のコマンドのみが実行されます。
ko: 두 명령이 동일한 키에 바인딩되어 있습니다 — 첫 번째 명령만 실행됩니다.
zh_hans: 两个命令绑定了同一个按键 —— 只有第一个会生效。
zh_hant: 兩個命令綁定到同一個按鍵上 — 只有第一個會觸發。

source: Usage
de: Verwendung
es: Uso
fr: Utilisation
ja: 使用方法
ko: 사용법
zh_hans: 用量
zh_hant: 用法

source: Use **Export** to write a single JSON file with your Glotty settings, learned memories, chat threads, and activity history. Use **Import** on another machine (or this one, after a wipe) to restore it. Imports REPLACE local data — you'll get a confirmation prompt first.
de: Verwenden Sie **Export**, um eine einzelne JSON-Datei mit Ihren Glotty-Einstellungen, gelernten Erinnerungen, Chat-Threads und Aktivitätsverlauf zu schreiben. Verwenden Sie **Import** auf einem anderen Gerät (oder diesem nach einem Zurücksetzen), um es wiederherzustellen. Importe ERSETZEN lokale Daten — Sie erhalten zunächst eine Bestätigungsabfrage.
es: Usa **Exportar** para escribir un solo archivo JSON con tus ajustes de Glotty, recuerdos aprendidos, hilos de chat e historial de actividad. Usa **Importar** en otra máquina (o esta, después de un restablecimiento) para restaurarlo. Las importaciones REEMPLAZAN los datos locales; primero recibirás un mensaje de confirmación.
fr: Utilisez **Exporter** pour écrire un fichier JSON unique avec vos paramètres Glotty, souvenirs appris, fils de discussion et historique d'activité. Utilisez **Importer** sur un autre ordinateur (ou celui-ci après une suppression) pour le restaurer. Les imports REMPLACENT les données locales — vous recevrez d'abord un message de confirmation.
ja: **Export** を使用すると、Glottyの設定、学習した記憶、チャットスレッド、活動履歴を単一のJSONファイルに書き出します。**Import** を別のマシン（またはこのマシンを初期化した後）で使用して復元します。インポートはローカルデータを置き換えます — 最初に確認プロンプトが表示されます。
ko: **내보내기**를 사용하여 Glotty 설정, 학습된 메모리, 채팅 스레드 및 활동 기록이 포함된 단일 JSON 파일을 작성하세요. 다른 기기(또는 지우기 후 이 기기)에서 **가져오기**를 사용하여 복원하세요. 가져오기는 로컬 데이터를 **바꿉니다** — 먼저 확인 프롬프트가 표시됩니다.
zh_hans: 使用「导出」将你的 Glotty 设置、学到的记忆、聊天对话和活动历史写入一个 JSON 文件。在另一台设备(或本机重置后)使用「导入」来恢复。导入会**替换**本地数据 —— 操作前会先弹出确认。
zh_hant: 使用 **匯出** 來寫入一個包含您的 Glotty 設定、已學習記憶、對話串和活動歷史的單一 JSON 檔案。在其他電腦（或在重置後的本機）上使用 **匯入** 來還原它。匯入會取代本機資料 — 您將先收到確認提示。

source: Use all
de: Alle verwenden
es: Usar todos
fr: Utiliser tout
ja: すべて使用
ko: 모두 사용
zh_hans: 全部使用
zh_hant: 全部使用

source: Use system default
de: Systemstandard verwenden
es: Usar valor predeterminado del sistema
fr: Utiliser le système par défaut
ja: システムのデフォルトを使用
ko: 시스템 기본값 사용
zh_hans: 跟随系统
zh_hant: 使用系統預設

source: Used for %@ → %@
de: Verwendet für %@ → %@
es: Se utiliza para %@ → %@
fr: Utilisé pour %@ → %@
ja: %@ → %@ の翻訳に使用
ko: %@ → %@에 사용됩니다
zh_hans: 用于 %@ → %@
zh_hant: 用於 %@ → %@

source: Voice
de: Sprache
es: Voz
fr: Voix
ja: 音声
ko: 음성
zh_hans: 语音
zh_hant: 語音

source: Weekly
de: Wöchentlich
es: Semanal
fr: Hebdomadaire
ja: 週次
ko: 주간
zh_hans: 每周
zh_hant: 每週

source: Welcome to Glotty
de: Willkommen bei Glotty
es: Te damos la bienvenida a Glotty
fr: Bienvenue dans Glotty
ja: Glotty へようこそ
ko: Glotty에 오신 것을 환영합니다
zh_hans: 欢迎使用 Glotty
zh_hant: 歡迎使用 Glotty

source: What should Glotty call you?
de: Wie soll Glotty Sie nennen?
es: ¿Cómo debería llamarte Glotty?
fr: Que devrais-je appeler Glotty ?
ja: Glottyはあなたを何と呼びますか？
ko: Glotty가 당신을 어떻게 불러야 하나요?
zh_hans: Glotty 应该怎么称呼你?
zh_hant: Glotty 應該如何稱呼您？

source: What this context is for (optional)
de: Wozu dieser Kontext dient (optional)
es: Para qué sirve este contexto (opcional)
fr: À quoi ce contexte sert (facultatif)
ja: このコンテキストの用途（オプション）
ko: 이 컨텍스트의 용도 (선택 사항)
zh_hans: 此上下文的用途（可选）
zh_hant: 此用途的說明 (選填)

source: What's in the bundle
de: Was ist im Bundle
es: Qué hay en el paquete
fr: Qu'y a-t-il dans le bundle
ja: バンドル内の内容
ko: 번들에 포함된 내용
zh_hans: 备份包含什么
zh_hant: 套件內容

source: When off, only the top-priority dict in each kind (monolingual + bilingual) is shown in the translation popup.
de: Wenn ausgeschaltet, wird nur das Wörterbuch mit höchster Priorität jeder Art (einsprachig + zweisprachig) im Übersetzungspopup angezeigt.
es: Cuando está desactivado, solo se muestra el diccionario de mayor prioridad de cada tipo (monolingüe + bilingüe) en la ventana emergente de traducción.
fr: Lorsqu'il est désactivé, seul le dictionnaire de priorité la plus élevée de chaque type (monolingue + bilingue) est affiché dans la popup de traduction.
ja: オフの場合、各種類（単語 + 両方）の最優先辞書のみが翻訳ポップアップに表示されます。
ko: 꺼져 있을 때, 각 종류(단일 언어 + 이중 언어)에서 우선 순위가 가장 높은 사전만 번역 팝업에 표시됩니다.
zh_hans: 关闭时，翻译弹窗中仅显示每种类型（单语+双语）中优先级最高的词典。
zh_hant: 關閉時，翻譯彈出視窗中只會顯示每種類型（單語+雙語）中最高優先順序的辭典。

source: When this memory set is injected into prompts
de: Wenn dieser Speicheratz in Eingabeaufforderungen eingefügt wird
es: Cuando este conjunto de memoria se inyecta en las indicaciones
fr: Lorsque ce jeu de souvenirs est injecté dans les invites
ja: このメモリーセットがプロンプトに挿入されたとき
ko: 이 메모리 세트가 프롬프트에 주입될 때
zh_hans: 当此记忆集被注入到提示中时
zh_hant: 當此記憶集被注入提示中

source: Writes one PNG per Settings tab (plus the Fn HUD) to /tmp/glotty-screenshots/ then opens that folder in Finder. Used for the in-flight localization audit.
de: Schreibt ein PNG pro Einstellungsregister (plus der Fn HUD) nach /tmp/glotty-screenshots/ und öffnet diesen Ordner im Finder. Wird für die laufende Lokalisierungsprüfung verwendet.
es: Escribe un PNG por pestaña de Ajustes (más la HUD de Fn) en /tmp/glotty-screenshots/ y luego abre esa carpeta en Finder. Se utiliza para la auditoría de localización en curso.
fr: Écrit un PNG par onglet Paramètres (plus le HUD Fn) dans /tmp/glotty-screenshots/ puis ouvre ce dossier dans Finder. Utilisé pour l'audit de localisation en cours.
ja: 設定タブごとに1つのPNG（Fn HUDを含む）を/tmp/glotty-screenshots/に書き込み、そのフォルダをFinderで開きます。フライト中のローカライズ監査に使用されます。
ko: 각 설정 탭( Fn HUD 포함)에 대해 하나의 PNG를 /tmp/glotty-screenshots/에 작성한 후 해당 폴더를 Finder에서 엽니다. 비행 중 현지화 감사에 사용됩니다.
zh_hans: 为每个设置标签(以及 Fn HUD)在 /tmp/glotty-screenshots/ 写入一张 PNG,然后在访达中打开该文件夹。用于正在进行的本地化检查。
zh_hant: 將每個設定頁面的 PNG（加上 Fn HUD）寫入 /tmp/glotty-screenshots/，然後在 Finder 中開啟該資料夾。用於進行中的當地化審計。

source: Yesterday
de: Gestern
es: Ayer
fr: Hier
ja: 昨日
ko: 어제
zh_hans: 昨天
zh_hant: 昨天

source: You can grant the missing ones now or skip this step and come back from the menu bar → Settings → Permissions later. The Translate/Polish/Explain demos in the next steps won't work until Accessibility and Input Monitoring are on.
de: Sie können die fehlenden Berechtigungen jetzt erteilen oder diesen Schritt überspringen und später aus der Menüleiste → Einstellungen → Berechtigungen zurückkehren. Die Translate/Polish/Explain-Demos in den nächsten Schritten funktionieren nicht, bis die Zugänglichkeit und die Eingabeüberwachung aktiviert sind.
es: Puedes conceder las faltantes ahora o omitir este paso y volver desde la barra de menú → Configuración → Permisos más tarde. Las demostraciones de Traducir/Corregir/Explicar en los siguientes pasos no funcionarán hasta que Accesibilidad y Monitoreo de entrada estén activados.
fr: Vous pouvez accorder les permissions manquantes maintenant ou ignorer cette étape et revenir plus tard depuis la barre de menus → Paramètres → Autorisations. Les démos de Traduire/Corriger/Expliquer dans les étapes suivantes ne fonctionneront pas tant que l'Accessibilité et le Contrôle des entrées ne seront pas activés.
ja: 今すぐ欠けている権限を付与するか、このステップをスキップして後でメニューバー → 設定 → 権限から戻ってくることができます。次のステップの翻訳/校正/説明のデモは、アクセシビリティと入力監視が有効になるまで機能しません。
ko: 지금 누락된 권한을 부여하거나 이 단계를 건너뛰고 나중에 메뉴 바 → 설정 → 권한에서 다시 올 수 있습니다. 다음 단계의 번역/교정/설명 데모는 접근성 및 입력 모니터링이 켜지지 않으면 작동하지 않습니다.
zh_hans: 您现在可以授予缺失的权限或跳过此步骤，稍后可通过菜单栏 → 设置 → 权限返回。下一步的翻译/润色/解释演示功能将在开启辅助功能和输入监控后才能使用。
zh_hant: 您現在可以授予缺少的權限，或跳過此步驟，稍後從功能表列 → 設定 → 權限中返回。直到啟用輔助功能和輸入監控，下一步的翻譯/潤飾/解釋示範才能正常運作。

source: You meant
de: Sie meinten
es: Quiciste decir
fr: Vous vouliez dire
ja: 意図した内容
ko: 의미하려던 것은
zh_hans: 您的意思是
zh_hant: 您的意思可能是

source: You meant: %@
de: Du meintest: %@
es: Quisiste decir: %@
fr: Vous vouliez dire : %@
ja: 意図したのは: %@
ko: 의도한 내용: %@
zh_hans: 你的意思是：%@
zh_hant: 您的意思是：%@

source: You wrote
de: Sie schrieben
es: Escribiste
fr: Vous avez écrit
ja: 書いた内容
ko: 작성한 내용은
zh_hans: 您写的是
zh_hant: 您寫的是

source: You wrote: %@
de: Du hast geschrieben: %@
es: Escribiste: %@
fr: Vous avez écrit : %@
ja: 書いたのは: %@
ko: 작성한 내용: %@
zh_hans: 你输入了：%@
zh_hant: 您寫的是：%@

source: Your native language
de: Ihre Muttersprache
es: Tu idioma nativo
fr: Votre langue native
ja: あなたの母国語
ko: 당신의 모국어
zh_hans: 你的母语
zh_hant: 您的母語

source: activity events
de: Aktivitätsereignisse
es: eventos de actividad
fr: événements d'activité
ja: アクティビティイベント
ko: 활동 이벤트
zh_hans: 条活动记录
zh_hant: 活動事件

source: checkmark
de: Häkchen
es: marca de verificación
fr: coche
ja: チェックマーク
ko: 확인 표시
zh_hans: 勾选标记
zh_hant: 勾選

source: contexts
de: Kontexte
es: contextos
fr: contextes
ja: コンテキスト
ko: 맥락
zh_hans: 个上下文
zh_hant: 情境

source: custom
de: Benutzerdefiniert
es: personalizado
fr: personnalisé
ja: カスタム
ko: 사용자 지정
zh_hans: 自定义
zh_hant: 自訂

source: days of chat
de: Chat-Tage
es: días de chat
fr: jours de discussion
ja: チャットの日数
ko: 채팅 일수
zh_hans: 天聊天
zh_hant: 天對話

source: e.g. "I'm learning German for a job in Berlin. Native English speaker, intermediate level."
de: z.B. "Ich lerne Deutsch für einen Job in Berlin. Muttersprache Englisch, fortgeschrittene Niveau."
es: por ejemplo "Estoy aprendiendo alemán para un trabajo en Berlín. Hablante nativo de inglés, nivel intermedio."
fr: par ex. "J'apprends l'allemand pour un travail à Berlin. Locuteur natif anglais, niveau intermédiaire."
ja: 例: "ベルリンでの仕事のためにドイツ語を学んでいます。母国語は英語、中級レベルです。"
ko: 예: "베를린에서 일하기 위해 독일어를 배우고 있습니다. 영어 모국어 사용자, 중급 수준."
zh_hans: 例如:「我正在为在柏林的工作学习德语。母语是英语,中级水平。」
zh_hant: 例如："我在柏林找工作，正在學德語。英語母語者，中級水平。"
